ELPasEDT/src/InformationRegisters/УровеньРаствораВМернике/УровеньРаствораВМернике.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УровеньРаствораВМернике</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/УровеньРаствораВМернике/ManagerModule.bsl
Функция ПолучитьУровень(Оборудование) Экспорт
	
	Уровень = 0;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УровеньРаствораВМерникеСрезПоследних.Уровень КАК Уровень
	|ИЗ
	|	РегистрСведений.УровеньРаствораВМернике.СрезПоследних(, Оборудование = &Оборудование) КАК УровеньРаствораВМерникеСрезПоследних");
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Уровень = Выборка.Уровень;
	КонецЕсли;
	
	Возврат Уровень;
	
КонецФункции
